Tekla Open API Reference for Tekla Structures 2025
Intersection.LineToLine Method
 Returns a new line segment which is the shortest path between the given lines or null if the lines are parallel. If the resulting line segment has a length of 0.0, the given lines actually intersect in 3d space.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static LineSegment LineToLine(
	Line line1,
	Line line2
)
Public Shared Function LineToLine (
	line1 As Line,
	line2 As Line
) As LineSegment
Parameters
line1
Type: Tekla.Structures.Geometry3d.Line
The first line to be used.
line2
Type: Tekla.Structures.Geometry3d.Line
The second line to be used.
Return Value
Type: LineSegment
The shortest line segment between the given lines or null if the lines are parallel.
See Also
Reference
Intersection Class
Tekla.Structures.Geometry3d Namespace